In [30]:
import pandas as pd
import sqlite3

In [16]:
orders = pd.read_csv("orders.csv")

In [18]:
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [19]:
users = pd.read_json("users.json")

In [21]:
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [22]:
conn = sqlite3.connect("restaurants.db")

with open("restaurants.sql", "r") as file:
    conn.executescript(file.read())

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)

In [23]:
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [24]:

orders_users = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

In [25]:
final_df = pd.merge(
    orders_users,
    restaurants,
    on="restaurant_id",
    how="left"
)

In [26]:
final_df.shape
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [27]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [29]:
final_df.isnull().sum()
final_df.describe()

          order_id       user_id  restaurant_id  total_amount        rating
count  10000.00000  10000.000000   10000.000000  10000.000000  10000.000000
mean    5000.50000   1504.117700     251.016700    801.162412      4.045430
std     2886.89568    861.727776     144.622558    405.458753      0.606531
min        1.00000      1.000000       1.000000    100.200000      3.000000
25%     2500.75000    761.000000     127.000000    446.310000      3.500000
50%     5000.50000   1508.000000     251.000000    806.295000      4.100000
75%     7500.25000   2250.250000     376.000000   1149.227500      4.600000
max    10000.00000   3000.000000     500.000000   1499.830000      5.000000